// 通用正则校验规则
export default {
  idPatter: /^[a-z0-9]{6,20}$/i, // 用户名,6-20位字母和数字组合
  phone: /^1[0-9]{10}/, // 手机号
  idCardPatter: /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/, // 身份证号
  namePatter: /^[\u4e00-\u9fa5]+$/, // 姓名或中文
  bankPatter: /^\d{15,}$/, // 银行卡号，15位数字
  pwdPatter: /^(?![a-zA-z]+$)(?!\d+$)(?![!&*]+$)[\w^&*]+$/, // 至少输入6-16位数字、字母、下划线其中两种
  amount: /(^[1-9](\d+)?(\.\d{1,2})?$)|(^0$)|(^\d\.\d{1,2}$)/,
  nameZN: /^([\u4e00-\u9fa5]){2,7}$/,   // 中文姓名
  idCard: /(^\d{15}$)|(^\d{18}$)|(^\d{17}(\d|X|x)$)/,  // 身份证号
  
}